Tekla.Structures.TeklaStructuresInternal.TeklaStructuresApplicationProxy
TS Service remote class proxy.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresApplicationProxy._Instance
The remote TS Service object.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresApplicationProxy.#cctor
Initializes static instance variable.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresApplicationProxy.Instance
Gets the singleton TS Service instance.